## 2. PANDAS

Python's pandas library, built on NumPy, is designed specifically for data management and analysis.Pandas is a python library used primarily to analyze data. In this module we introduce pandas data structures, syntax, and explore its capabilities for quickly analyzing and presenting data.The study of the data structure of pandas is divided into Series and DataFrame.<br>

### Pandas Data Structures

### Series

The first pandas data strucuture is a Series. A Series is a one-dimensional array that can hold any datatype, similar to a ndarray. However, a Series has a **index** that gives a a label to each entry. An index generally is used to label the data.
Typically a Series contains information about **one feature** of the data. <br>

In [3]:
import numpy as np 
import pandas as pd
from pandas import Series

In [5]:
math = pd.Series(np.arange(5.,21.,3.),['joyce','jeremy','ivan','marcy','daniel','franclin'])
math

joyce        5.0
jeremy       8.0
ivan        11.0
marcy       14.0
daniel      17.0
franclin    20.0
dtype: float64

In [12]:
english = pd.Series(np.random.randint(0,100,5), ['alessandra', 'alexis', 'scott', 'miguel', 'carlos'])
english

alessandra    18
alexis        53
scott         45
miguel        39
carlos        22
dtype: int32

In [13]:
num1 = pd.Series([10,15,16,19,20,81])
num1

0    10
1    15
2    16
3    19
4    20
5    81
dtype: int64

In [14]:
names = Series(["andres" ,"lucas","pedro","pedro","juan"])
names

0    andres
1     lucas
2     pedro
3     pedro
4      juan
dtype: object

In [15]:
mix = Series([True ,False,"andres","lucas","pedro","juan",1,2,3])
mix

0      True
1     False
2    andres
3     lucas
4     pedro
5      juan
6         1
7         2
8         3
dtype: object

In [16]:
# Dictionary
notes = {'math':14,'language':17,'chemistry':12,'biology':16}
notes

{'math': 14, 'language': 17, 'chemistry': 12, 'biology': 16}

In [17]:
reg = pd.Series(notes)
reg

math         14
language     17
chemistry    12
biology      16
dtype: int64

In [18]:
example_1 = Series([5,6,7,8])
example_1

0    5
1    6
2    7
3    8
dtype: int64

In [19]:
example_2 = pd.Series([5,6,7,8], index = ['a','b','c','d'])
example_2

a    5
b    6
c    7
d    8
dtype: int64

### DataFrame

A DataFrame is a collection of multiple Series. It can be thought of as a 2-dimensional array, where each row is a separate datapoint and each column is a feature of the data. The rows are labeled with an index(as in a Series) and the columns are lebeled in the attribute columns.<br>
There are many different ways to initialize a DataFrame. <br>

#### Example<br>
 One way to initialize a DataFrame is by passing in a dictionary as the data of the DataFrame. The keys of the dictionary will become the labels in columns and the values are the Series associated with the label.

In [20]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [21]:
# lists
students = ["Alejandro","Pedro","Ramiro","Axel","Juan"]
math = [15,16,10,12,13]
english = [13,9,16,14,17]
art = [12,16,15,19,10]

# Dictionary
notes_1b = {'students':students, 'math_1b':math, 'english_1b':english, 'art_1b':art}
notes_1b

{'students': ['Alejandro', 'Pedro', 'Ramiro', 'Axel', 'Juan'],
 'math_1b': [15, 16, 10, 12, 13],
 'english_1b': [13, 9, 16, 14, 17],
 'art_1b': [12, 16, 15, 19, 10]}

In [22]:
b1 = pd.DataFrame(notes_1b)
b1

    students  math_1b  english_1b  art_1b
0  Alejandro       15          13      12
1      Pedro       16           9      16
2     Ramiro       10          16      15
3       Axel       12          14      19
4       Juan       13          17      10

In [23]:
b1.columns

Index(['students', 'math_1b', 'english_1b', 'art_1b'], dtype='object')

In [24]:
names =  ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr = [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

reg_cars = {"country":names, "drives_right":dr, "cars_per_cap":cpc}

In [25]:
cars = pd.DataFrame(reg_cars)
cars

         country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

In [26]:
cars.columns

Index(['country', 'drives_right', 'cars_per_cap'], dtype='object')

In [27]:
cars.index

RangeIndex(start=0, stop=7, step=1)

In [28]:
departments = {'state': ['Lima', 'Piura', 'Tumbes', 'Cuzco', 'Ica', 'Puno'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
regions = pd.DataFrame(departments)
regions

    state  year  pop
0    Lima  2000  1.5
1   Piura  2001  1.7
2  Tumbes  2002  3.6
3   Cuzco  2001  2.4
4     Ica  2002  2.9
5    Puno  2003  3.2

In [29]:
# change the order or the name of the columns
regions_change = pd.DataFrame(regions, columns = ['year','state','pop'])
regions_change

   year   state  pop
0  2000    Lima  1.5
1  2001   Piura  1.7
2  2002  Tumbes  3.6
3  2001   Cuzco  2.4
4  2002     Ica  2.9
5  2003    Puno  3.2

In [30]:
# add a column and indexs
regions_2 = pd.DataFrame(departments, index=['one', 'two', 'three', 'four','five', 'six'], columns=["year", 'state', 'pop', 'debt'])
regions_2

       year   state  pop debt
one    2000    Lima  1.5  NaN
two    2001   Piura  1.7  NaN
three  2002  Tumbes  3.6  NaN
four   2001   Cuzco  2.4  NaN
five   2002     Ica  2.9  NaN
six    2003    Puno  3.2  NaN

In [31]:
regions_2['debt'] = [1,3,4,5,6,7]
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     4
four   2001   Cuzco  2.4     5
five   2002     Ica  2.9     6
six    2003    Puno  3.2     7

In [33]:
regions_2['debt'] = np.arange(1,12,2)
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [35]:
regions_2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [36]:
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

### Data Manipulation

#### Accesing Data

#### ***loc( ) and iloc( )***

While array slicing can be used to access data in a DataFrame, it is always preferable to use the
loc and iloc indexers. Accessing Series and DataFrame objects using these indexing operations
is more efficient than slicing because the bracket indexing has to check many cases before it can
determine how to slice the data structure. Using loc/iloc explicitly, bypasses the extra checks. The
**loc index** selects **rows and columns based on their labels**, while **iloc** selects **them based on their
integer position**. When using these indexers, **the first and second arguments refer to the rows and
columns, respectively, just as array slicing**.

In [37]:
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [38]:
regions_2.iloc[1]

year      2001
state    Piura
pop        1.7
debt         3
Name: two, dtype: object

In [39]:
regions_2.iloc[1:4]

       year   state  pop  debt
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7

In [40]:
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [41]:
regions_2.iloc[1,1]

'Piura'

In [42]:
regions_2.iloc[:,:2]

       year   state
one    2000    Lima
two    2001   Piura
three  2002  Tumbes
four   2001   Cuzco
five   2002     Ica
six    2003    Puno

In [44]:
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [43]:
# loc ()
regions_2.loc['two']

year      2001
state    Piura
pop        1.7
debt         3
Name: two, dtype: object

In [45]:
regions_2.loc['two','state']

'Piura'

In [47]:
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [49]:
regions_2.loc['two':'six','year':'pop']

       year   state  pop
two    2001   Piura  1.7
three  2002  Tumbes  3.6
four   2001   Cuzco  2.4
five   2002     Ica  2.9
six    2003    Puno  3.2

In [51]:
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [50]:
# sort_values
regions_2.sort_values('year')

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
four   2001   Cuzco  2.4     7
three  2002  Tumbes  3.6     5
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [52]:
regions_2.sort_values('year', ascending = False)

       year   state  pop  debt
six    2003    Puno  3.2    11
three  2002  Tumbes  3.6     5
five   2002     Ica  2.9     9
two    2001   Piura  1.7     3
four   2001   Cuzco  2.4     7
one    2000    Lima  1.5     1

In [54]:
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [53]:
regions_2.sort_values(['year','pop'],ascending = False)

       year   state  pop  debt
six    2003    Puno  3.2    11
three  2002  Tumbes  3.6     5
five   2002     Ica  2.9     9
four   2001   Cuzco  2.4     7
two    2001   Piura  1.7     3
one    2000    Lima  1.5     1

In [56]:
regions_2.sort_index()

       year   state  pop  debt
five   2002     Ica  2.9     9
four   2001   Cuzco  2.4     7
one    2000    Lima  1.5     1
six    2003    Puno  3.2    11
three  2002  Tumbes  3.6     5
two    2001   Piura  1.7     3

In [57]:
b1

    students  math_1b  english_1b  art_1b
0  Alejandro       15          13      12
1      Pedro       16           9      16
2     Ramiro       10          16      15
3       Axel       12          14      19
4       Juan       13          17      10

In [58]:
b1['total'] = b1['math_1b'] + b1['english_1b'] + b1['art_1b']
b1

    students  math_1b  english_1b  art_1b  total
0  Alejandro       15          13      12     40
1      Pedro       16           9      16     41
2     Ramiro       10          16      15     41
3       Axel       12          14      19     45
4       Juan       13          17      10     40

In [59]:
b1_total = b1
b1_total

    students  math_1b  english_1b  art_1b  total
0  Alejandro       15          13      12     40
1      Pedro       16           9      16     41
2     Ramiro       10          16      15     41
3       Axel       12          14      19     45
4       Juan       13          17      10     40

|Method|Description|
|------|-----------|
|append( )| Concatenate two or more Series.|
|drop( )| Remove the entries with the specified label or labels|
|drop_duplicates( )| Remove duplicate values|
|dropna( ) |Drop null entries|
|fillna( ) |Replace null entries with a specified value or strategy|
|reindex( )| Replace the index|
|sample( ) |Draw a random entry|
|shift( ) |Shift the index|
|unique( ) |Return unique values|

In [60]:
# drop ( )
b1 = b1.drop(columns = ['total'])
b1

    students  math_1b  english_1b  art_1b
0  Alejandro       15          13      12
1      Pedro       16           9      16
2     Ramiro       10          16      15
3       Axel       12          14      19
4       Juan       13          17      10

In [61]:
b1_total

    students  math_1b  english_1b  art_1b  total
0  Alejandro       15          13      12     40
1      Pedro       16           9      16     41
2     Ramiro       10          16      15     41
3       Axel       12          14      19     45
4       Juan       13          17      10     40

In [62]:
b1_total.drop(['total','art_1b'], axis = 1)

    students  math_1b  english_1b
0  Alejandro       15          13
1      Pedro       16           9
2     Ramiro       10          16
3       Axel       12          14
4       Juan       13          17

In [64]:
b1_total

    students  math_1b  english_1b  art_1b  total
0  Alejandro       15          13      12     40
1      Pedro       16           9      16     41
2     Ramiro       10          16      15     41
3       Axel       12          14      19     45
4       Juan       13          17      10     40

In [65]:
b1_total.drop(columns = ['total','art_1b'])

    students  math_1b  english_1b
0  Alejandro       15          13
1      Pedro       16           9
2     Ramiro       10          16
3       Axel       12          14
4       Juan       13          17

In [67]:
b1_total

    students  math_1b  english_1b  art_1b  total
0  Alejandro       15          13      12     40
1      Pedro       16           9      16     41
2     Ramiro       10          16      15     41
3       Axel       12          14      19     45
4       Juan       13          17      10     40

In [66]:
total_2 = b1_total.drop([0,1]) < 40

  students  math_1b  english_1b  art_1b  total
2   Ramiro       10          16      15     41
3     Axel       12          14      19     45
4     Juan       13          17      10     40

In [68]:
b1_total.drop([0,1,2])

  students  math_1b  english_1b  art_1b  total
3     Axel       12          14      19     45
4     Juan       13          17      10     40

In [69]:
# append()
ent = pd.DataFrame([[1,2],[4,5]], columns = list('AB'), index = ['a','b'])
ent

   A  B
a  1  2
b  4  5

In [70]:
dec = pd.DataFrame([[.4,.3],[.5,.8]], columns = list('AB'), index = ['a','b'])
dec

     A    B
a  0.4  0.3
b  0.5  0.8

In [71]:
ent.append(dec)

     A    B
a  1.0  2.0
b  4.0  5.0
a  0.4  0.3
b  0.5  0.8

In [72]:
ent.append(dec, ignore_index = True)

     A    B
0  1.0  2.0
1  4.0  5.0
2  0.4  0.3
3  0.5  0.8

In [73]:
regions_2

       year   state  pop  debt
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [74]:
reg_1 = regions_2.iloc[:2]
reg_1

     year  state  pop  debt
one  2000   Lima  1.5     1
two  2001  Piura  1.7     3

In [75]:
reg_2 = regions_2.iloc[2:]
reg_2

       year   state  pop  debt
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11

In [76]:
reg_app = reg_2.append(reg_1)
reg_app

       year   state  pop  debt
three  2002  Tumbes  3.6     5
four   2001   Cuzco  2.4     7
five   2002     Ica  2.9     9
six    2003    Puno  3.2    11
one    2000    Lima  1.5     1
two    2001   Piura  1.7     3

In [77]:
reg_app = reg_2.append(reg_1, ignore_index = True)
reg_app

   year   state  pop  debt
0  2002  Tumbes  3.6     5
1  2001   Cuzco  2.4     7
2  2002     Ica  2.9     9
3  2003    Puno  3.2    11
4  2000    Lima  1.5     1
5  2001   Piura  1.7     3

In [78]:
# drop_duplicates
cars = pd.DataFrame({
    'brands': ['hyundai', 'hyundai', 'kia', 'kia', 'kia'],
    'model': ['sedan', 'sedan', 'sedan', 'truck', 'truck'],
    'passengers': [4, 4, 5, 6, 8]})
cars

    brands  model  passengers
0  hyundai  sedan           4
1  hyundai  sedan           4
2      kia  sedan           5
3      kia  truck           6
4      kia  truck           8

In [79]:
cars.drop_duplicates()

    brands  model  passengers
0  hyundai  sedan           4
2      kia  sedan           5
3      kia  truck           6
4      kia  truck           8

In [80]:
cars.drop_duplicates(subset = ['brands'])

    brands  model  passengers
0  hyundai  sedan           4
2      kia  sedan           5

In [81]:
cars.drop_duplicates(subset = ['brands','model'], keep = 'last')

    brands  model  passengers
1  hyundai  sedan           4
2      kia  sedan           5
4      kia  truck           8